
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 2 to change, 1 to destroy.</code></pre>

* Create
  * module.citizen-ui-draft-store.azurerm_redis_cache.redis
* Update
  * azurerm_key_vault_secret.redis_draft_store_access_key
  * module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds
* Replace
  * module.citizen-ui-draft-store.azurerm_resource_group.cache-resourcegroup[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.redis_draft_store_access_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "redis_draft_store_access_key" {
        id                      = "https://civil-citizen-ui-aat.vault.azure.net/secrets/draft-store-access-key/eb722014be6948baa411f710714e08cf"
        name                    = "draft-store-access-key"
      ~ tags                    = {
          - "BuiltFrom"           = "https://github.com/HMCTS/civil-citizen-ui.git"
          - "application"         = "civil"
          - "businessArea"        = "CFT"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#civil_contact"
          - "environment"         = "staging"
          - "managedBy"           = "Civil"
          - "source"              = "redis civil-citizen-ui-draft-store-aat.redis.cache.windows.net"
        } -> (known after apply)
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # module.citizen-ui-draft-store.azurerm_redis_cache.redis will be created
  + resource "azurerm_redis_cache" "redis" {
      + capacity                      = 1
      + enable_non_ssl_port           = false
      + family                        = "P"
      + hostname                      = (known after apply)
      + id                            = (known after apply)
      + location                      = "uksouth"
      + minimum_tls_version           = "1.2"
      + name                          = "civil-citizen-ui-draft-store-aat"
      + port                          = (known after apply)
      + primary_access_key            = (sensitive value)
      + primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      + public_network_access_enabled = true
      + redis_version                 = "4"
      + replicas_per_master           = (known after apply)
      + replicas_per_primary          = (known after apply)
      + resource_group_name           = "civil-citizen-ui-draft-store-cache-aat"
      + secondary_access_key          = (sensitive value)
      + secondary_connection_string   = (sensitive value)
      + sku_name                      = "Premium"
      + ssl_port                      = (known after apply)
      + subnet_id                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/core-infra-subnet-1-aat"
      + tags                          = {
          + "BuiltFrom"           = "https://github.com/HMCTS/civil-citizen-ui.git"
          + "application"         = "civil"
          + "businessArea"        = "CFT"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#civil_contact"
          + "environment"         = "staging"
          + "managedBy"           = "Civil"
        }

      + redis_configuration {
          + enable_authentication           = true
          + maxclients                      = (known after apply)
          + maxfragmentationmemory_reserved = 642
          + maxmemory_delta                 = 642
          + maxmemory_policy                = "volatile-lru"
          + maxmemory_reserved              = 642
        }
    }

  # module.citizen-ui-draft-store.azurerm_resource_group.cache-resourcegroup[0] must be replaced
-/+ resource "azurerm_resource_group" "cache-resourcegroup" {
      ~ id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-cache-draft-store-cache-aat" -> (known after apply)
      ~ name     = "civil-citizen-ui-cache-draft-store-cache-aat" -> "civil-citizen-ui-draft-store-cache-aat" # forces replacement
        tags     = {
            "BuiltFrom"           = "https://github.com/HMCTS/civil-citizen-ui.git"
            "application"         = "civil"
            "businessArea"        = "CFT"
            "changeUrl"           = ""
            "contactSlackChannel" = "#civil_contact"
            "environment"         = "staging"
            "managedBy"           = "Civil"
        }
        # (1 unchanged attribute hidden)
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-citizen-ui-aat/providers/Microsoft.KeyVault/vaults/civil-citizen-ui-aat|civil-citizen-ui-aat"
      + log_analytics_destination_type = "AzureDiagnostics"
        name                           = "civil-citizen-ui-aat"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 2 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1757,"Program":"tfcmt","SHA1":"","Vars":{}} -->